Revit 2024 API
TransactionGroup.IsFailureHandlingForcedModal Property
 Forces all transactions finished inside this group to use modal failure handling regardless of what failure handling options are set for those transactions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsFailureHandlingForcedModal { get; set; }
Visual Basic
Public Property IsFailureHandlingForcedModal As Boolean
	Get
	Set
Visual C++
public:
property bool IsFailureHandlingForcedModal {
	bool get ();
	void set (bool value);
}
Remarks
 This property is ignored during events, when failure handling is always modal.
See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace